tbirz/Tank-Control-System/ESP8266WebServerTankMonitoring/src/ESP8266WebServerTankMonitoring.cpp
#include <WiFiClient.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
ESP8266WebServer server(80);
#include <WiFiManager.h>  // https://github.com/tzapu/WiFiManager
#include <DNSServer.h>
#include <WebSocketsServer.h>
WebSocketsServer webSocket = WebSocketsServer(81); //webSocket is used to manage the websocket connection


/*
//Static IP address configuration for hotspot
IPAddress ip(192, 168, 99, 117); //ESP static ip
IPAddress gateway(192, 168, 43, 1);   //IP Address of your WiFi Router (Gateway)
IPAddress subnet(255, 255, 255, 0);  //Subnet mask
IPAddress dns(8, 8, 8, 8);  //DNS


//Enter your Wi-Fi SSID and PASSWORD
const char* ssid     = "Tigerland";
const char* password = "1980premiers";
const char* deviceName = "ESP8266";
*/





int connCount = 0; //connCount is used to count the number of connections to the web server
int serialSwapped = 0; //serialSwapped is used to indicate that the serial port has been swapped
int wsConnected = 0; //wsConnected is used to indicate that the websocket has been connected
int wsDisconnected = 0; //wsDisconnected is used to indicate that the websocket has been disconnected
String wsPayload = ""; //wsPayload is used to capture the websocket payload from client (webpage)
String rxTempString = "";  //rxTempString used to capture incoming serial data
String rxSystemAlarm = ""; //rxSystemAlarm is used to capture the system alarm status
String rxOperatingMode = "";  //rxOperatingMode is used to capture the operating mode
String rxAvailableCapacity = ""; //rxAvailableCapacity is used to capture the available capacity
String rxPercentageLevel = "";  //rxPercentageLevel is used to capture the percentage level
String rxActualLevel = ""; //rxActualLevel is used to capture the actual level
String rxTemperatureLevel = "";  //rxTemperatureLevel is used to capture the temperature level
String rxTankHeight = "";  //rxTankHeight is used to capture the tank height
String rxRefillSetPoint = "";  //rxRefillSetPoint is used to capture the refill set point
String rxFullSetPoint = "";  //rxFullSetPoint is used to capture the Tank full set point
String rxTotalCapacity = "";  //rxTotalCapacity is used to capture the total Tank capacity
String rxController12v = "";  //rxController12v is used to capture the 12v controller status
String rxController7v = "";  //rxController7v is used to capture the 7v controller status
String rxController5v = "";  //rxController5v is used to capture the 5v controller status
String rxController3v3 = "";  //rxController3v3 is used to capture the 3.3v controller status
String rxControllerVacConst = ""; //rxControllerVacConst is used to capture the Vac controller status
String rxControllerVacSw = "";  //rxControllerVacSw is used to capture the Vac controller switch status
String rxBatteryVoltageLevel = "";  //rxBatteryVoltageLevel is used to capture the battery voltage level
String rxSensorControl5v = "";  //rxSensorControl5v is used to capture the 5v sensor control status
String rxServo1Position = "";  //rxServo1Position is used to capture the servo 1 position
String rxServo2Position = "";  //rxServo2Position is used to capture the servo 2 position
String rxRelay1Position = "";  //rxRelay1Position is used to capture the relay 1 position
String rxRelay2Position = "";  //rxRelay2Position is used to capture the relay 2 position
String rxTankEmpty = "";  //rxTankEmpty is used to capture the tank empty status
String rxTankFull = "";  //rxTankFull is used to capture the tank full status
String rxTankLevelOk = "";  //rxTankLevelOk is used to capture the tank level ok status
String rxPumpRunning = "";   //rxPumpRunning is used to capture the pump running status
String rxRadioLinkRunning = "";  //rxRadioLinkRunning is used to capture the radio link running status
String rxServosRunning = "";  //rxServosRunning is used to capture the servos running status
String rxVacActive = "";  //rxVacActive is used to capture the Vac active status
String rxTankFilling = "";  //rxTankFilling is used to capture the tank filling status
String rxBuzzerActive = "";  //rxBuzzerActive is used to capture the buzzer active status

//baud rate for the serial port
long baud = 9600;
//tmpString is used to capture incoming serial data
String tmpString = "";
//count the number of characters received
unsigned int count = 0;
//maximum number of characters in the buffer
const byte maxBuffer = 64;
//use the buffer to capture incoming serial data
//define buffer as a static array to avoid stack overflow errors when using dynamic memory allocation (new) 
char buffer[maxBuffer-1];
//webData is the data that is sent to the web page
char webData[maxBuffer];
//idxData is the index of the data in the buffer
byte idxData = 0;





// This function returns an HTML formated page in the correct type for display
// It uses the Raw string macro 'R' to place commands in PROGMEM
const char Web_page[] PROGMEM = R"=====(  
<!DOCTYPE html>
<html>
<html lang="en">

<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css">
  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.4.1/jquery.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.16.0/umd/popper.min.js"></script>
  <script src="https://maxcdn.bootstrapcdn.com/bootstrap/4.4.1/js/bootstrap.min.js"></script>
<script>
$(document).ready(function(){
  
     $("#popoverOpMode").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverOpModes(),
    });

     $("#popoverTankFull").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverTankLevelOk").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverTankEmpty").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });
    
