tbirz/Tank-Control-System/ESP8266WebServerTankMonitoring/src/ESP8266WebServerTankMonitoring.cpp
    $("#popoverTankFilling").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });
    
    $("#popoverPumpRunning").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverServosRunning").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

     $("#popoverServo1Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });

    $("#popoverServo2Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });

    $("#popoverRadioLinkActive").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverVacConstActive").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    });

    $("#popoverRelay1Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });

    $("#popoverRelay2Position").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverSwitching(),
    });
    
    $("#popoverBuzzerActive").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverONOFF(),
    }); 

    $("#popoverSystemAlarm").popover({
    html:true,
    placement: 'right',
    trigger: 'hover',
    content:popoverAlarm(),
    });
});

</script>
<style>

    #heading {
          color: lime;
          font-size: 75%;
          font-weight: bold;
          margin-bottom: 0px;
        }    
    .table th {
          text-align: center;
          font-size: 85%;
        }    
    .table td {
          text-align: center;
          font-size: 70%;
        }
    #popoverRef td {
      display:hidden;
     align-items:left;
     text-align: left;
     font-size: 70%;     
    }
    #circleOpMode {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode0 {
      background: lime;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode1 {
      background: green;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode2 {
      background: yellow;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
     }
       #circleOpMode3 {
      background: orange;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOpMode4 {
      background: grey;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
      #circleOFF {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleON {
      background: lime;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
      #circleUNSW {
      background: lime;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleSW {
      background: blue;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleALARM {
      background: orange;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    } 
    #circleERROR {
      background: red;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleOTHER {
      background: black;
      border: 1px solid black;
      border-radius: 50%;
      height: 10px;
      width: 10px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankFull {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankLevelOk {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankEmpty {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleTankFilling {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circlePumpRunning {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleServosRunning {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleServo1Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleServo2Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleRadioLinkActive {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: middle;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleVacActive {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleRelay1Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleRelay2Position {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
    #circleBuzzerActive {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
     #circleSystemAlarm {
      background: transparent;
      border: 1px solid black;
      border-radius: 50%;
      height: 15px;
      width: 15px;
      display: inline-block;
      align-self: center;
      justify-self: center;
      -webkit-border-radius: 25px;
      -moz-border-radius: 25px;
    }
  
