tbirz/Tank-Control-System/ESP8266WebServerTankMonitoring/src/ESP8266WebServerTankMonitoring.cpp
.navbar {
 height:60px;
}

 #rxConsole {
  width: 755px!important; 
  height:30px;
  } 

  #txBuff {
    height:30px;
    width:250px!important;
  }
  #txButt {
    height:30px;
  }
  
  </style>

<body>
  <div id="heading" class="bg-primary font-weight-bold">
    <h1 style="text-align:center;">Water Tank Controller Status Web Page</h1>
    <p style="text-align:center; color:yellow; font-size:70%;">(Best viewed with the 'Chrome' browser)</p>
    <h6><p style="text-align:center; color: navy; font-size:85%;">Current DTG: <span style="color: white; font-size:85%;" id='DTG'>Current DTG</span></p>   
    <p style="text-align:center; color: navy; font-size:85%;">WS-Status: <span style="color: white; font-size:85%;" id='ws-Status'>Status</span></p>
  </div

<nav class="navbar navbar-expand-sm bg-dark navbar-dark" style="display:inline-block" justify-content-center>
  <form class="form-inline" justify-content-center> 
   <input class="form-control ml-sm-5" justify-content-center id="rxConsole"  type="text" readonly placeholder="Rx Data (read only)">   
   <input class="form-control ml-sm-5" justify-content-center type="text" id="txBuff" placeholder="Tx Data" onkeydown="if(event.keyCode == 13) enterPressed();">
   <input class="btn btn-success ml-sm-2" id="txButt" type="submit" onclick="enterPressed();" value="Send">
  </form> 
</nav>
<br>
  <div class="container">
    <div class="row">
      <div class="col-sm-4">
        <table id="actuals" class="table table-bordered table-sm border border-success">
          <h6><span class="badge badge-success">Actuals</span></h6>
            <thead class=" bg-success border border-success">
              <tr class="d-flex">
                <th class="col-6 border border-success">Reading</th>
                <th class="col-4 border border-success">Value</th>
                <th class="col-2 border border-success">Unit</th>
              </tr>
            </thead>
            <tbody>
              <tr id="actuals1" class="d-flex">
                <td class="col-6 font-weight-bold border border-success">Percentage Full</td>
                <td class="col-4 font-weight-bold border border-success"><span id="PercentageLevel">---.--</span></td>
                <td class="col-2 font-weight-bold border border-success">%</td>
              </tr>
              <tr id="actuals2" class="d-flex">
                <td class="col-6 font-weight-bold border border-success">Available Capacity</td>
                <td class="col-4 font-weight-bold border border-success"><span id="AvailableCapacity">-----.--</span></td>
                <td class="col-2 font-weight-bold border border-success">Ltrs</td>
              </tr>
              <tr id="actuals3" class="d-flex">
                <td class="col-6 font-weight-bold border border-success">Actual Level (from Top)</td>
                <td class="col-4 font-weight-bold border border-success"><span id="ActualLevel">---.--</span></td>
                <td class="col-2 font-weight-bold border border-success">cm</td>
              </tr>
              <tr id="actuals4" class="d-flex">
                <td class="col-6 font-weight-bold border border-success">Water Temperature</td>
                <td class="col-4 font-weight-bold border border-success"><span id="TemperatureLevel">----.--</span></td>
                <td class="col-2 font-weight-bold border border-success">&degC</td>
              </tr>
            </tbody>
        </table>
        <table id="controlFunctions class="table table-bordered table-sm border border-info">
          <h6><span class="badge badge-info">Select Control Functions</span></h6>
          <thead class="bg-info border border-info">
            <tr class="d-flex">
            </tr>
          </thead>
          <tbody>
            <tr id="controlFunctions1" class="d-flex">
            <button type="button" class="btn btn-outline-info btn-sm btn-block" onclick="btnselectSpare1()">spare button</button>  
            </tr>
            <tr id="controlFunctions2" class="d-flex">
              <button type="button" class="btn btn-outline-info btn-sm btn-block" onclick="btnselectResetWebServer()">Reset WebServer</button>  
              </tr>
              <tr id="controlFunctions3" class="d-flex">
                <button type="button" class="btn btn-outline-info btn-sm btn-block" onclick="btnselectPumpOff()">Switch Pump Off</button>
              </tr>
              <tr id="controlFunctions4" class="d-flex">
                <button type="button" class="btn btn-outline-info btn-sm btn-block" onclick="btnselectPumpOn()">Switch Pump On</button>
              </tr>  
            <tr id="controlFunctions5" class="d-flex">
              <button type="button" class="btn btn-outline-info btn-sm btn-block" onclick="btnselectChangeServoPosition()">Change Servo(s) Position</button>
            </tr>
            <tr id="controlFunctions6" class="d-flex">
              <button type="button" class="btn btn-outline-info btn-sm btn-block" onclick="btnselectResetController()">Reset Controller</button>
            </tr>
            <tr id="controlFunctions7" class="d-flex">
              <button type="button" class="btn btn-outline-info btn-sm btn-block" onclick="btnselectRefreshPage()">Refresh Page</button>  
              </tr>
          </tbody>
        </table>
        <table id="popoverRef" class="d-none table-bordered table-sm border border-success">
          <h6><span class="d-none badge badge-success">popoverRef</span></h6>
            <thead class=" bg-success border border-success">
              <tr class="d-flex border border-success">
                <th class="col-12 border border-success">Description</th>
              </tr>
            </thead>
            <tbody>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef1"><span id="circleOpMode0"></span> TDPSA - Tank Disconnected, Pump Stopped in Auto Mode</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef2"><span id="circleOpMode1"></span> TCPRA - Tank Connected, Pump Running in Auto Mode</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef3"><span id="circleOpMode2"></span> TDPSM - Tank Disconnected, Pump Stopped in Manual Mode</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef4"><span id="circleOpMode3"></span> TCPRM - Tank Cconnected, Pump Running in Manual Mode</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef5"><span id="circleOpMode4"></span> TDPSB - Tank Disconnected, Pump Stopped in Bypass Mode</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef6"><span id="circleOFF"></span> OFF</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef7"><span id="circleON"></span> ON</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef8"><span id="circleUNSW"></span> UNSWITCHED</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverRef9"><span id="circleSW"></span> SWITCHED</td>
              </tr> 
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverError"><span id="circleError"></span> ERROR</td>
              </tr>
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverOther"><span id="circleError"></span> OTHER</td>
              </tr> 
              <tr class="d-flex">
                <td class="col-sm-12 font-weight-bold border border-primary" id="popoverAlarm"><span id="circleAlarm"></span> ALARM</td>
              </tr>          
            </tbody>
        </table>
      </div>
      <div class="col-sm-4">
        <table id="controllerIndicators" class="table table-bordered table-sm">
          <h6><span class="badge badge-primary">Controller Indicators</span></h6>
          <thead class="bg-primary border border-primary">
            <tr class="d-flex border border-primary">
              <th class="col-sm-8 border border-primary">Property</th>
              <th class="col-sm-4 border border-primary">Status</th>
              <th class="d-none border border-primary">Code</th>
            </tr>
          </thead>
          <tbody>
            <tr id="controllerIndicators1" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Operating Mode</td>
              <td class="d-none"><span id="OperatingMode">----</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverOpMode" title="Indications:"></a><span id="circleOpMode"></span></td>
            </tr>
            <tr id="controllerIndicators2" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Tank Full</td>
              <td class="d-none font-weight-bold"><span id="TankFull">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverTankFull" title="Indications:"></a><span id="circleTankFull"></span></td>
            </tr>
            <tr id="controllerIndicators3" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Tank Level Ok</td>
              <td class="d-none font-weight-bold"><span id="TankLevelOk">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverTankLevelOk" title="Indications:"></a><span id="circleTankLevelOk"></span></td>
            </tr>
            <tr id="controllerIndicators4" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Tank Empty</td>
              <td class="d-none font-weight-bold"><span id="TankEmpty">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverTankEmpty" title="Indications:"></a><span id="circleTankEmpty"></span></td>
            </tr>
            <tr id="controllerIndicators5" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Tank Filling</td>
              <td class="d-none font-weight-bold"><span id="TankFilling">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverTankFilling" title="Indications:"></a><span id="circleTankFilling"></span></td>
            </tr>
            <tr id="controllerIndicators6" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Pump Running</td>
              <td class="d-none font-weight-bold"><span id="PumpRunning">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverPumpRunning" title="Indications:"></a><span id="circlePumpRunning"></span></td>
            </tr>
            <tr id="controllerIndicators7" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Servos Running</td>
              <td class="d-none font-weight-bold"><span id="ServosRunning">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverServosRunning" title="Indications:"></a><span id="circleServosRunning"></span></td>
            </tr>
            <tr id="controllerIndicators8" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Servo1 Position</td>
              <td class="d-none font-weight-bold"><span id="Servo1Position">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverServo1Position" title="Indications:"></a><span id="circleServo1Position"></span></td>
            </tr>
            <tr id="controllerIndicators9" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Servo2 Position</td>
              <td class="d-none font-weight-bold"><span id="Servo2Position">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverServo2Position" title="Indications:"></a><span id="circleServo2Position"></span></td>
            </tr>
            <tr id="controllerIndicators10" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Radio Link Active</td>
              <td class="d-none font-weight-bold"><span id="RadioLinkActive">-/span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverRadioLinkActive" title="Indications:"></a><span id="circleRadioLinkActive"></span></td>
            </tr>
            <tr id="controllerIndicators11" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">VAC Const Active</td>
              <td class="d-none font-weight-bold"><span id="VacConstActive">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverVacConstActive" title="Indications:"></a><span id="circleVacActive"></span></td>
            </tr>
            <tr id="controllerIndicators12" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Relay1 Position</td>
              <td class="d-none font-weight-bold"><span id="Relay1Position">--</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverRelay1Position" title="Indications:"></a><span id="circleRelay1Position"></span></td>
            </tr>
            <tr id="controllerIndicators13" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Relay2 Position</td>
              <td class="d-none font-weight-bold"><span id="Relay2Position">--</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverRelay2Position" title="Indications:"><span id="circleRelay2Position"></span></td>
            </tr>
            <tr id="controllerIndicators14" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">Buzzer Active</td>
              <td class="d-none font-weight-bold"><span id="BuzzerActive">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverBuzzerActive" title="Indications:"><span id="circleBuzzerActive"></span></td>
            </tr>
            <tr id="controllerIndicators15" class="d-flex">
              <td class="col-sm-8 font-weight-bold border border-primary">System Alarm</td>
              <td class="d-none font-weight-bold"><span id="SystemAlarm">-</span></td>
              <td class="col-sm-4 font-weight-bold border border-primary" <a href="#" id="popoverSystemAlarm" title="Indications:"><span id="circleSystemAlarm"></span></td>
            </tr>
          </tbody>
        </table>
      </div>
      <div class="col-sm-4">
        <table id="controllerVoltages" class="table table-bordered table-sm border border-dark">
          <h6><span class="badge badge-dark">Controller DC Voltages</span></h6>
          <thead class="thead-dark border border-dark">
            <tr class="d-flex border border-dark">
              <th class="col-5 border border-dark">Voltage</th>
              <th class="col-4 border border-dark">Value</th>
              <th class="col-3 border border-dark">Unit</th>
            </tr>
          </thead>
          <tbody>
            <tr id="controllerVoltages1" class="d-flex">
              <td class="col-5 font-weight-bold border border-dark">Control (12v)</td>
              <td class="col-4 font-weight-bold border border-dark"><span id="Controller12v">--.--</span></td>
              <td class="col-3 font-weight-bold border border-dark">Vdc</td>
            </tr>
            <tr id="controllerVoltages2" class="d-flex">
              <td class="col-5 font-weight-bold border border-dark">Control (7v)</td>
              <td class="col-4 font-weight-bold border border-dark"><span id="Controller7v">--.--</span></td>
              <td class="col-3 font-weight-bold border border-dark">Vdc</td>
            </tr>
            <tr id="controllerVoltages3" class="d-flex">
              <td class="col-5 font-weight-bold border border-dark">Control (5v)</td>
              <td class="col-4 font-weight-bold border border-dark"><span id="Controller5v">--.--</span></td>
              <td class="col-3 font-weight-bold border border-dark">Vdc</td>
            </tr>
            <tr id="controllerVoltages4" class="d-flex">
              <td class="col-5 font-weight-bold border border-dark">Control (3v3)</td>
              <td class="col-4 font-weight-bold border border-dark"><span id="Controller3v3">--.--</span></td>
              <td class="col-3 font-weight-bold border border-dark">Vdc</td>
            </tr>
            <tr id="controllerVoltages5" class="d-flex">
              <td class="col-5 font-weight-bold border border-dark">Constant (28v)</td>
              <td class="col-4 font-weight-bold border border-dark"><span id="controllerVacConst">--.--</span></td>
              <td class="col-3 font-weight-bold border border-dark">Vac</td>
            </tr>
            <tr id="controllerVoltages6" class="d-flex">
              <td class="col-5 font-weight-bold border border-dark">Switched (28v)</td>
              <td class="col-4 font-weight-bold border border-dark"><span id="controllerVacSw">--.--</span></td>
              <td class="col-3 font-weight-bold border border-dark">Vac</td>
            </tr>
          </tbody>
        </table>
        <table id="remoteSensorVoltages" class="table table-bordered table-sm border border-secondary">
          <h6><span class="badge badge-secondary">Remote Sensor Voltages</span></h6>
          <thead class="bg-secondary border border-secondary">
            <tr class="d-flex border border-secondary">
              <th class="col-5 border border-secondary">Voltage</th>
              <th class="col-4 border border-secondary">Value</th>
              <th class="col-3 border border-secondary">Unit</th>
            </tr>
          </thead>
          <tbody>
            <tr id="remoteSensorVoltages1" class="d-flex">
              <td class="col-5 font-weight-bold border border-secondary">Battery Input (12v)</td>
              <td class="col-4 font-weight-bold border border-secondary"><span id="BatteryVoltageLevel">--.--</span></td>
              <td class="col-3 font-weight-bold border border-secondary">Vdc</td>
            </tr>
            <tr id="remoteSensorVoltages2" class="d-flex">
              <td class="col-5 font-weight-bold border border-secondary">Control (5v)</td>
              <td class="col-4 font-weight-bold border border-secondary"><span id="SensorControl5v">--.--</span></td>
              <td class="col-3 font-weight-bold border border-secondary">Vdc</td>
            </tr>
          </tbody>
        </table>
        <table id="fixedInfo" class="table table-bordered table-sm border border-info">
          <h6><span class="badge badge-info">Water Tank Static Info</span></h6>
          <thead class="bg-info border border-info">
            <tr class="d-flex">
              <th class="col-6 border border-info">Description</th>
              <th class="col-4 border border-info">Value</th>
              <th class="col-2 border border-info">Unit</th>
            </tr>
          </thead>
          <tbody>
            <tr id="fixedInfo1" class="d-flex">
              <td class="col-6 font-weight-bold border border-info">Tank Height</td>
              <td class="col-4 font-weight-bold border border-info"><span id="TankHeight">---.--</span></td>
              <td class="col-2 font-weight-bold border border-info">cm</td>
            </tr>
            <tr id="fixedInfo2" class="d-flex">
              <td class="col-6 font-weight-bold border border-info">Refill Set Point</td>
              <td class="col-4 font-weight-bold border border-info"><span id="RefillSetPoint">---.--</span></td>
              <td class="col-2 font-weight-bold border border-info">cm</td>
            </tr>
            <tr id="fixedInfo3" class="d-flex">
              <td class="col-6 font-weight-bold border border-info">Full Set Point</td>
              <td class="col-4 font-weight-bold border border-info"><span id="FullSetPoint">--.--</span></td>
              <td class="col-2 font-weight-bold border border-info">cm</td>
            </tr>
            <tr id="fixedInfo4" class="d-flex">
              <td class="col-6 font-weight-bold border border-info">Total Capacity (Volume)</td>
              <td class="col-4 font-weight-bold border border-info"><span id="TotalCapacity">-----.--</span></td>
              <td class="col-2 font-weight-bold border border-info">Ltrs</td>
            </tr>
          </tbody>
        </div>
    </div>
  </div>

  <script>

