tbirz/Tank-Control-System/ESP8266WebServerTankMonitoring/src/ESP8266WebServerTankMonitoring.cpp
function socketErrors() {// Log errors
  Socket.onerror = function (e) {
    console.log('WebSocket Error: ' + e.message);
  } 
}
//----------------------------------------------------------------------------
// Functions for Control Buttons
//----------------------------------------------------------------------------

function btnselectSpare1() {
  if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
   document.getElementsById("txBuff").value=="spare1";
  Socket.send(document.getElementById("txBuff").value);
  alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted"); 
  document.getElementsById("txBuff")=="";
}
}
function btnselectResetWebServer() {
  if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
   document.getElementsById("txBuff").value=="resetWebServer";
  Socket.send(document.getElementById("txBuff").value);
  alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted"); 
  document.getElementsById("txBuff")=="";
}
}
function btnselectResetController() {
  if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
   document.getElementsById("txBuff").value=="resetCont";
  Socket.send(document.getElementById("txBuff").value);
  alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted"); 
  document.getElementsById("txBuff")=="";
}
}
function btnselectChangeServoPosition() {
  if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
   document.getElementsById("txBuff").value=="servoPosChange";
  Socket.send(document.getElementById("txBuff").value);
  alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted"); 
  document.getElementsById("txBuff")=="";
}
}
function btnselectPumpON() {
  if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
   document.getElementsById("txBuff").value=="pumpON";
  Socket.send(document.getElementById("txBuff").value);
  alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted"); 
  document.getElementsById("txBuff")=="";
}
}
function btnselectPumpOFF() {
  if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
   document.getElementsById("txBuff").value=="pumpOFF";
  Socket.send(document.getElementById("txBuff").value);
  alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted");
  document.getElementsById("txBuff")=="";
}
}
function btnselectRefreshPage() {
  if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
   document.getElementsById("txBuff").value=="refreshPage";
  Socket.send(document.getElementById("txBuff").value);
  alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted");
  document.getElementsById("txBuff")=="";
}
}
//----------------------------------------------------------------------------
function enterPressed() {//function for when 'send' button pressed
   if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
      document.getElementById("txButt").style.color="red"; 
      Socket.send(document.getElementById("txBuff").value); //Send the data from txBuff input to server, to use this function just input the string you want to send.
       //alert("Submitted code: " && document.getElementById("txBuff").value && " has been transmitted");
      document.getElementById("txBuff").value = ""; //clears the textbox after data is sent
   }
   else if(Socket.readyState==1 && document.getElementById("txBuff").value == "") {
         alert("To submit you must add text!.");
         return;
   }
}
   
function addLoadEvent(func) {
   var oldonload = window.onload;
   if (typeof window.onload != 'function') {
       window.onload = func;
   } 
   else {
          window.onload = function() {
          if (oldonload) {
              oldonload();
          }
          func();
          }   
  }
}
addLoadEvent(initWebSockets);
addLoadEvent(statusCondition);

setInterval(function () { updateDTG(); }, 1000); //used for showing current DTG

function updateDTG() {
  var d = new Date();
  var t = "";
  t = d.toLocaleString('en-AU', { hour12: false });
  document.getElementById('DTG').innerHTML = t;
}

function statusCondition() {
  checkPercentageLevel();
  checkTemperatureLevel();
  checkControllerDCVoltageLevels();
  checkControllerACVoltageLevels();
  checkRemoteSensorDCVoltageLevels();
  checkControllerIndicators();
  checkFixedInfo();
}
//----------------------------------------------------------------------------
// Status Color for table rows & indicators
//----------------------------------------------------------------------------
 //Static Table Info
function checkFixedInfo() {     
  var tblFixedInfo = document.getElementById('fixedInfo');
  var rowValue;
  for(i=1; i<tblFixedInfo.rows.length; i++){
    rowValue=tblFixedInfo.rows[i].cells[tblFixedInfo.rows[i].cells.length-2].innerText;
    rowValue=parseFloat(rowValue);
    //console.log(rowValue);
    if(isNaN(rowValue)) {
      bgColor='red';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'white';
    }
    else if(rowValue >0) {
      bgColor='yellowgreen';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'initial';
    }
    else if(rowValue <=0) {
      bgColor='red';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'white';
    }
    else {
      bgColor='transparent';
      tblFixedInfo.rows[i].style.backgroundColor = bgColor;
      tblFixedInfo.rows[i].style.color = 'initial';
    }              
  }                   
} 
//----------------------------------------------------------------------------
  //Control Status Indicators
   function checkControllerIndicators() {
    //OperatingMode
      var opMode = document.getElementById("OperatingMode").innerHTML;
      if (opMode == '0') { //TDPSA
        document.getElementById("circleOpMode").style.backgroundColor = 'lime';
      }
      else if (opMode == '1') { //TCPRA
        document.getElementById("circleOpMode").style.backgroundColor = 'green';
      }
      else if (opMode == '2') { //TDPSM
        document.getElementById("circleOpMode").style.backgroundColor = 'yellow';
      }
      else if (opMode == '3') { //TCPRM
        document.getElementById("circleOpMode").style.backgroundColor = 'orange';
      }
      else if (opMode == '4') { //TDPSB
        document.getElementById("circleOpMode").style.backgroundColor = 'grey';
      }
      else if (isNaN(opMode)) {
        document.getElementById("circleOpMode").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleOpMode").style.backgroundColor = 'black';
      }

