tbirz/Tank-Control-System/ESP8266WebServerTankMonitoring/src/ESP8266WebServerTankMonitoring.cpp
      //TankFull
      var tankFull = document.getElementById("TankFull").innerHTML;
      if (tankFull == '1') {
        document.getElementById("circleTankFull").style.backgroundColor = 'lime';
      }
      else if (tankFull == '0') {
        document.getElementById("circleTankFull").style.backgroundColor = 'transparent';
      }
       else if (isNaN(tankFull)) {
        document.getElementById("circleTankFull").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankFull").style.backgroundColor = 'black';
      }

      //TankLevelOk
      var tankLevelOk = document.getElementById("TankLevelOk").innerHTML;
      if (tankLevelOk == '1') {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'lime';
      }
      else if (tankLevelOk == '0') {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'transparent';
      }
      else if (isNaN(tankLevelOk)) {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankLevelOk").style.backgroundColor = 'black';
      }

      //TankEmpty
      var tankEmpty = document.getElementById("TankEmpty").innerHTML;
      if (tankEmpty == '1') {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'lime';
      }
      else if (tankEmpty == '0') {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'transparent';
      }
      else if (isNaN(tankEmpty)) {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankEmpty").style.backgroundColor = 'black';
      }

      //TankFilling
      var tankFilling = document.getElementById("TankFilling").innerHTML;
      if (tankFilling == '1') {
        document.getElementById("circleTankFilling").style.backgroundColor = 'lime';
      }
      else if (tankFilling == '0') {
        document.getElementById("circleTankFilling").style.backgroundColor = 'transparent';
      }
       else if (isNaN(tankFilling)) {
        document.getElementById("circleTankFilling").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleTankFilling").style.backgroundColor = 'black';
      }

      //PumpRunning
      var pumpRunning = document.getElementById("PumpRunning").innerHTML;
      if (pumpRunning == '1') {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'lime';
      }
      else if (pumpRunning == '0') {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'transparent';
      }
       else if (isNaN(pumpRunning)) {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circlePumpRunning").style.backgroundColor = 'black';
      }

      //ServosRunning
      var servosRunning = document.getElementById("ServosRunning").innerHTML;
      if (servosRunning == '1') {
        document.getElementById("circleServosRunning").style.backgroundColor = 'lime';
      }
      else if (servosRunning == '0') {
        document.getElementById("circleServosRunning").style.backgroundColor = 'transparent';
      }
       else if (isNaN(servosRunning)) {
        document.getElementById("circleServosRunning").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleServosRunning").style.backgroundColor = 'black';
      }

      //Servo1Position
      var servo1Position = document.getElementById("Servo1Position").innerHTML;
      if (servo1Position == '0') { //vertical
        document.getElementById("circleServo1Position").style.backgroundColor = 'lime';
      }
      else if (servo1Position == '1') { //horizontal
        document.getElementById("circleServo1Position").style.backgroundColor = 'blue';
      }
       else if (isNaN(servo1Position)) {
        document.getElementById("circleServo1Position").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleServo1Position").style.backgroundColor = 'black';
      }

      //Servo2Position
      var servo2Position = document.getElementById("Servo2Position").innerHTML;
      if (servo2Position == '0') { //horizontal
        document.getElementById("circleServo2Position").style.backgroundColor = 'lime';
      }
      else if (servo2Position == '1') { //vertical
        document.getElementById("circleServo2Position").style.backgroundColor = 'blue';
      }
       else if (isNaN(servo2Position)) {
        document.getElementById("circleServo2Position").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleServo2Position").style.backgroundColor = 'black';
      }

      //RadioLinkRunning
      var radioLinkActive = document.getElementById("RadioLinkActive").innerHTML;
      if (radioLinkActive == '1') {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'lime';
      }
      else if (radioLinkActive == '0') {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'transparent';
      }
       else if (isNaN(radioLinkActive)) {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleRadioLinkActive").style.backgroundColor = 'black';
      }

      //VacConstActive
      var vacConstActive = document.getElementById("VacConstActive").innerHTML;
      if (vacConstActive == '1') {
        document.getElementById("circleVacActive").style.backgroundColor = 'lime';
      }
      else if (vacConstActive == '0') {
        document.getElementById("circleVacActive").style.backgroundColor = 'transparent';
      }
      else if (isNaN(vacConstActive)) {
        document.getElementById("circleVacActive").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleVacActive").style.backgroundColor = 'black';
      }
      

