tbirz/Tank-Control-System/ESP8266WebServerTankMonitoring/src/ESP8266WebServerTankMonitoring.cpp
      //Relay1Position
      var relay1Position = document.getElementById("Relay1Position").innerHTML;
      if (relay1Position == '0') {
        document.getElementById("circleRelay1Position").style.backgroundColor = 'lime';
      }
      else if (relay1Position == '1') {
        document.getElementById("circleRelay1Position").style.backgroundColor = 'blue';
      }
      else if (isNaN(relay2Position)) {
        document.getElementById("circleRelay1Position").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleRelay1Position").style.backgroundColor = 'black';
      }

      //Relay2Position
      var relay2Position = document.getElementById("Relay2Position").innerHTML;
      if (relay2Position == '0') {
        document.getElementById("circleRelay2Position").style.backgroundColor = 'lime';
      }
      else if (relay2Position == '1') {
        document.getElementById("circleRelay2Position").style.backgroundColor = 'blue';
      }
        else if (isNaN(relay2Position)) {
        document.getElementById("circleRelay2Position").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleRelay2Position").style.backgroundColor = 'black';
      }

      //BuzzerActive
      var buzzerActive = document.getElementById("BuzzerActive").innerHTML;
      if (buzzerActive =='0') {
        document.getElementById("circleBuzzerActive").style.backgroundColor = 'transparent';
      }
      else if (buzzerActive == '1') {
        document.getElementById("circleBuzzerActive").style.backgroundColor = 'lime';
      }
      else if (isNaN(buzzerActive)) {
        document.getElementById("circleBuzzerActive").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleBuzzerActive").style.backgroundColor = 'black';
      } 

      //SystemAlarm
      var systemAlarm = document.getElementById("SystemAlarm").innerHTML;
      if (systemAlarm =='0') {
        document.getElementById("circleSystemAlarm").style.backgroundColor = 'transparent';
      }
      else if (systemAlarm == '1') {
        document.getElementById("circleSystemAlarm").style.backgroundColor = 'orange';
      }
      else if (isNaN(systemAlarm)) {
        document.getElementById("circleSystemAlarm").style.backgroundColor = 'red';
      }
      else {
        document.getElementById("circleSystemAlarm").style.backgroundColor = 'black';
      } 
}   
//----------------------------------------------------------------------------
function checkControllerDCVoltageLevels() {
      //controller voltages:
      var value12v = document.getElementById("Controller12v").innerHTML;
      value12v = parseFloat(value12v);
      var value7v = document.getElementById("Controller7v").innerHTML;
      value7v = parseFloat(value7v);
      var value5v = document.getElementById("Controller5v").innerHTML;
      value5v = parseFloat(value5v);
      var value3v3 = document.getElementById("Controller3v3").innerHTML;
      value3v3 = parseFloat(value3v3);

      if (value12v >= 10.8 && value12v <= 13.2) {
        document.getElementById("controllerVoltages1").style.backgroundColor = "yellowgreen";
        document.getElementById("controllerVoltages1").style.color = "initial";
      }
      else {
        document.getElementById("controllerVoltages1").style.backgroundColor = "red";
        document.getElementById("controllerVoltages1").style.color = "white";
      }

      if (value7v >= 6.3 && value7v <= 7.7) {
        document.getElementById("controllerVoltages2").style.backgroundColor = "yellowgreen";
        document.getElementById("controllerVoltages2").style.color = "initial";
      }
      else {
        document.getElementById("controllerVoltages2").style.backgroundColor = "red";
        document.getElementById("controllerVoltages2").style.color = "white";
      }

      if (value5v >= 4.5 && value5v <= 5.5) {
        document.getElementById("controllerVoltages3").style.backgroundColor = "yellowgreen";
        document.getElementById("controllerVoltages3").style.color = "initial";
      }
      else {
        document.getElementById("controllerVoltages3").style.backgroundColor = "red";
        document.getElementById("controllerVoltages3").style.color = "white";
      }

      if (value3v3 >= 2.97 && value3v3 <= 3.63) {
        document.getElementById("controllerVoltages4").style.backgroundColor = "yellowgreen";
        document.getElementById("controllerVoltages4").style.color = "initial";
      }
      else {
        document.getElementById("controllerVoltages4").style.backgroundColor = "red";
        document.getElementById("controllerVoltages4").style.color = "white";
      }
}       
//----------------------------------------------------------------------------
function checkControllerACVoltageLevels() {
      //controller AC voltages:
      var valueVacConst = document.getElementById("controllerVacConst").innerHTML;
      valueVacConst = parseFloat(valueVacConst);
      var valueVacSw = document.getElementById("controllerVacSw").innerHTML;
      valueVacSw = parseFloat(valueVacSw);

      //vac Const
    if (valueVacConst >= 23.5 && valueVacConst <= 29.5) {
        document.getElementById("controllerVoltages5").style.backgroundColor = "yellowgreen";
        document.getElementById("controllerVoltages5").style.color = "initial";
      }
      else {
        document.getElementById("controllerVoltages5").style.backgroundColor = "red";
        document.getElementById("controllerVoltages5").style.color = "white";
      }

      //vac Switched
      if (valueVacSw >= 23.5 && valueVacSw <= 29.5) {
        document.getElementById("controllerVoltages6").style.backgroundColor = "yellowgreen";
        document.getElementById("controllerVoltages6").style.color = "initial";
      }
      else {
        document.getElementById("controllerVoltages6").style.backgroundColor = "red";
        document.getElementById("controllerVoltages6").style.color = "white";
      }
}    
//----------------------------------------------------------------------------
function checkRemoteSensorDCVoltageLevels() {
      //remote Sensor Voltages
      var valueRS12v = document.getElementById("BatteryVoltageLevel").innerHTML;
      valueRS12v = parseFloat(valueRS12v);
      var valueRS5v = document.getElementById("SensorControl5v").innerHTML;
      valueRS5v = parseFloat(valueRS5v);
      //12v Battery
      if (valueRS12v >= 10.8 && valueRS12v <= 13.2) {
        document.getElementById("remoteSensorVoltages1").style.backgroundColor = "yellowgreen";
        document.getElementById("remoteSensorVoltages1").style.color = "initial";
      }
      else {
        document.getElementById("remoteSensorVoltages1").style.backgroundColor = "red";
        document.getElementById("remoteSensorVoltages1").style.color = "white";
      }
      //5v Control
      if (valueRS5v >= 4.5 && valueRS5v <= 5.5) {
        document.getElementById("remoteSensorVoltages2").style.backgroundColor = "yellowgreen";
        document.getElementById("remoteSensorVoltages2").style.color = "initial";
      }
      else {
        document.getElementById("remoteSensorVoltages2").style.backgroundColor = "red";
        document.getElementById("remoteSensorVoltages2").style.color = "white";
      }
}   
//----------------------------------------------------------------------------
function checkPercentageLevel() {  
      // Percentage reading affects first 3 rows in 'actuals' table.
      var tblActuals = document.getElementById('actuals');
      var rowValue;
      for(i=1; i<tblActuals.rows.length-1; i++){  
          rowValue=tblActuals.rows[i].cells[tblActuals.rows[i].cells.length-2].innerText;
          rowValue=parseFloat(rowValue);
          //console.log(rowValue);
          if (i==1) {
             if(isNaN(rowValue) || rowValue <=0) {
                bgColor='red';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
             }
             else if(rowValue < 0 && rowValue > 100) {
                bgColor='red';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
             }
             else  if(rowValue >= 95 && rowValue < 100) {
                bgColor='dodgerblue';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
             }
             else if(rowValue >= 75 && rowValue < 95) {
                bgColor='lightgreen';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'initial';
             }
             else if(rowValue >= 50 && rowValue < 75) {
                bgColor='yellow';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'initial';
             }
             else if(rowValue >= 10 && rowValue < 50) {
                bgColor='orange';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'initial';
             }
             else if(rowValue >= 0 && rowValue < 10) {
                bgColor='lightgrey';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
             }
           }
           if (i==2) { //Available capacity
             if(isNaN(rowValue) || rowValue <=0) {
                bgColor='red';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
             }
             else if(rowValue > 0) {
               tblActuals.rows[i].style.backgroundColor = "" + tblActuals.rows[1].style.backgroundColor;
               tblActuals.rows[i].style.color = '' + tblActuals.rows[1].style.color;
             } 
           }
           if (i==3) { //Actual Level (from Top)
             if(isNaN(rowValue) || rowValue <20) {//FullSetPoint
                bgColor='red';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
             }
             else if(rowValue >= 20) { //FullSetPoint
                tblActuals.rows[i].style.backgroundColor = "" + tblActuals.rows[1].style.backgroundColor;
                tblActuals.rows[i].style.color = '' + tblActuals.rows[1].style.color;
             } 
           }
       }                             
} 
//---------------------------------------------------------------------------- 
 function checkTemperatureLevel() {  
    // Temperature reading located on 5th (bottom) row of 'actuals' table.
    var tblActuals = document.getElementById('actuals');
    var rowValue;
    for(i=1; i<tblActuals.rows.length; i++){  
       rowValue=tblActuals.rows[i].cells[tblActuals.rows[i].cells.length-2].innerText;
       if (i==4) {
          rowValue=parseFloat(rowValue);
          //console.log(rowValue);
          if(isNaN(rowValue) || rowValue <=0) {
             bgColor='red';
             tblActuals.rows[i].style.backgroundColor = bgColor;
             tblActuals.rows[i].style.color = 'white';
          }
          else if(rowValue >40) {
                bgColor='crimson';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
          }
          else if(rowValue >= 30 && rowValue <= 40) {
                bgColor='orange';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'initial';
          }
          else if(rowValue >= 20 && rowValue <= 30) {
                bgColor='yellow';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'initial';
          }
          else if(rowValue >= 10 && rowValue <= 20) {
                bgColor='grey';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'white';
          }
          else if(rowValue >= 0 && rowValue <= 10) {
                bgColor='white';
                tblActuals.rows[i].style.backgroundColor = bgColor;
                tblActuals.rows[i].style.color = 'initial';
          }
          break; 
       }
    }                              
} 
//----------------------------------------------------------------------------

window.addEventListener("change",statusCondition(),false);  

window.onload = function(e){ 
    initWebSockets();
    wsReadyState();
    setTxItemStatus();
    socketReceive();
    socketErrors();
    socketClose();
    statusCondition();
}
</script>
</body>
<title>Water Tank Status Monitor</title>
</head>

</html>
)=====";



//===================================================================
// This routine is executed when you open a browser at the IP address
//===================================================================
void handleRoot() {
  //Display HTML contents
 // String s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n";
  digitalWrite(2, 0); //Blinks on board led on page request
  server.send(200, "text/html",Web_page); //Send web page
  digitalWrite(2, 1);
} 
//------------------------------------------------------------------------//
void webSocketEvent(byte num, WStype_t type, uint8_t * payload, size_t length) { //for receiving websockets data


// Figure out the type of WebSocket event
  switch(type) {

    // Client has disconnected
    case WStype_DISCONNECTED:
        wsDisconnected = 1; 
        break;

    // New client has connected
    case WStype_CONNECTED:
        wsConnected = 1;     
        break;

    // Handle text messages from client
    case WStype_TEXT:
      {  
        // since payload is a pointer we need to type cast to char
       for(int i = 0; i <  maxBuffer; i++) { 
        wsPayload+= String((char *) &payload[i]);
        }
       String((char *) &payload)="\0"; //clear payload
       break;
      }       
    
	  
	case WStype_PING:
            // pong will be send automatically
            Serial.printf("[WSc] get ping\n");
            break;
			
    case WStype_PONG:
            // answer to a ping we send
            Serial.printf("[WSc] get pong\n");
            break; 

    // For everything else: do nothing
    case WStype_BIN:
    case WStype_ERROR:
    case WStype_FRAGMENT_TEXT_START:
    case WStype_FRAGMENT_BIN_START:
    case WStype_FRAGMENT:
    case WStype_FRAGMENT_FIN:
    
    default:
      break;
  }
} 
//------------------------------------------------------------------------//
void processData() {
  const char startByte = '<';
  const char stopByte = '>';
  byte overflowBuffer=0;
  byte index =0;
  byte idx=0;
  byte rxData=0;
  byte txData=0;
  String junk="";
  String overflowMsg="Overflow Occured!";
  delay(250);
  Serial.swap(); //to rx GPIO13, tx GPIO15 from tx GPIO1, rx GPIO3 (default)
  delay(250);
  serialSwapped=1;
  if (connCount==1) {
    if (Serial.available()) {
      Serial1.println();
      Serial1.println("Serial available.");
      Serial1.println();
      rxData=0;   
    while (Serial.available() > 0){
          char inChar = {(char)Serial.read()}; 
       if (inChar == startByte) { // If start byte is received
          index = 0; 
       } 
       else if (inChar == stopByte) { // If end byte is received  
          webData[index] = '\0'; // then null terminate for end of data
          idx=index;
          index = 0; // this isn't necessary, but helps limit overflow
          rxData=1; //Data received
          webSocket.broadcastTXT(webData, sizeof(webData));
          txData=1;
       }
       else { // otherwise
          webData[index] = inChar; // put the character into our array
          index++; // and move to the next key in the array
       }
       
       if (index >= maxBuffer) {
        overflowBuffer=1;
       }
    }
        junk = Serial.read();
    }
    else {
      Serial1.println();
      Serial1.println("Serial NOT available to rx data.");
    }            
}        
  delay(250);
  Serial.swap(); // back to tx GPIO1, rx GPIO3 default
  delay(250);
  if (serialSwapped==1) {
    serialSwapped=0; 
  }
  if (rxData==1) {
    Serial.print("Data Received from Controller: ") && Serial.print(idx) && Serial.println(" bytes");
    rxData=0;
 }
   if (txData==1) {
    Serial.print("Data Sent to Webpage: ") && Serial.print(idx) && Serial.println(" bytes");   
    txData=0;
    idx=0; 
 }
 if (overflowBuffer==1) {
  Serial.println(overflowMsg);
  overflowBuffer=0;
 } 
 if (wsPayload.length()> 0) {
  //Serial.print("Length of wsPayload: ") && Serial.println(wsPayload.length());  
  void clientCommandActions();
  //Serial.println();
  //Serial.println(wsPayload);
  //wsPayload="";
 }
 if (wsConnected==1 && connCount==0) {
   Serial.println("ClientSocket Connected!");
   connCount=1;
}
else if (wsDisconnected==1 && connCount==1) {
  Serial.println("ClientSocket Disconnected!");
    Serial.println("Socket connection Failed Resetting Server.....");
    ESP.restart();
}
}
//------------------------------------------------------------------------//
void handleWebRequests(){
  String msg = "Error 404: WebPage Not Detected\n\n";
  msg += "URI: ";
  msg += server.uri();
  msg += server.args();
  msg += "\n";
  for (uint8_t i=0; i<server.args(); i++){
    msg += " NAME:"+server.argName(i) + "\n VALUE:" + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", msg);
  Serial.println(msg);
}
//------------------------------------------------------------------------//
void clientCommandActions(String wsPayload) {
//Serial.println(wsPayload);

 if (wsPayload == "resetCont") {
          Serial.println("Resetting Controller.....");
          Serial1.print(wsPayload);
 }
  else if (wsPayload == "resetWebServer") {
          Serial.println("Resetting ESP8266 Server.....");
          ESP.restart();
 }
  else if (wsPayload == "pumpOFF") {
          Serial.println("Turning Off Pump");
          Serial1.print(wsPayload);
  }
  else if (wsPayload == "refreshPage") {
          Serial.println("Refreshing Webpage.....");
          handleRoot();
  }
   else if (wsPayload == "pumpON") {  
          Serial.println("Turning On Pump");
          Serial1.print(wsPayload);
   }
   else if (wsPayload == "servoPosChange") {
          Serial.println("Changing Servo Position");
          Serial1.print(wsPayload);
   }
   else {
          Serial.println (wsPayload);
          wsPayload="";
   }     
}
//--------------------------------------------------------------------------//
void setup(void){ 

  String wsPayload="";
    pinMode(2,OUTPUT);
   Serial.begin(baud); //tx GPIO1, rx GPIO3 default
    Serial1.begin(baud); //tx only gpio2 for debugging

