tbirz/Tank-Control-System/ESP8266WebServerTankMonitoring/src/ESP8266WebServerTankMonitoring.cpp
/*
//  int idx=0;
//int idxCount=0; 
WiFi.disconnect();  //Prevent connecting to wifi based on previous configuration

  WiFi.hostname(deviceName);      // DHCP Hostname (useful for finding device for static lease)
    Serial.println();
    Serial.print("Device: ") && Serial.println(deviceName);
   Serial.print("MAC: ") && Serial.println(WiFi.macAddress());
  WiFi.config(ip, gateway, subnet, dns);
    delay(100);

  WiFi.mode(WIFI_STA);        // Connect to your wifi
 WiFi.begin(ssid, password);// Start the Wi-Fi services
  Serial.print("Connecting to: ") && Serial.println(ssid);
  
    while (WiFi.status() != WL_CONNECTED) { // Wait for WiFi to connect 
    if (idxCount==250) {
    Serial.println();
    Serial.println("Failed to connect to router. Resetting.....");
    ESP.restart();
    }
    if(idx==50) {
     Serial.println(); 
     idx=0;
    }
    Serial.print(".");
    delay(100);
    idx++;
    idxCount++;
    } 
    idxCount=0;
    idx=0;   
    
  Serial.println();  
  Serial.println("Connected to: "+String(ssid));
  Serial.print("Using IP address: ");
  Serial.println(WiFi.localIP());  //IP address assigned to your ESP 

*/


     // WiFiManager
   WiFi.mode (WIFI_STA);
  // Local intialization. Once its business is done, there is no need to keep it around
  WiFiManager wifiManager;
  
  // Uncomment and run it once, if you want to erase all the stored information
  //
  
  //wifiManager.resetSettings();
   // fetches ssid and pass from eeprom and tries to connect
  // if it does not connect it starts an access point with the specified name
  // here  "AutoConnectAP"
  // and goes into a blocking loop awaiting configuration
  //wifiManager.autoConnect("AutoConnectAP"); //anonymous ap  
  //wifiManager.autoConnect(); // use this for auto generated name ESP + ChipID
  bool wifiSetupStatus; // variable to hold the status of the wifi connection

  wifiSetupStatus = wifiManager.autoConnect("ESP8266_Wifi_Connect","1980premiers"); //specific ap
  if (!wifiSetupStatus) {
    Serial.println("Failed to connect");
    ESP.restart();
  } 
  else {
    Serial.println("Connected.");
  }
  delay(500);
   //while (!Serial){
   // ;
    //}
    

     server.on("/", handleRoot); // This displays the main webpage, it is called when you open a client connection on the IP address using a browser
     server.onNotFound(handleWebRequests); //Set setver all paths are not found so we can handle as per URI 
     server.begin();

     Serial.println("HTTP server started");

//--------------------------- 
  webSocket.begin();   // start the websocket server
  webSocket.onEvent(webSocketEvent);
  webSocket.enableHeartbeat(15000, 3000, 2); // 15 sec ping, 3 sec pong, 2 fails = disconnect
 
  
  Serial.println("WebSocket server started.");



}//end SETUP
 
void loop(void)
{
    server.handleClient();  // Keep checking for a client connection
    webSocket.loop();
    processData(); // rx data from controller tx to webpage via websockets   
}//end LOOP